; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-94)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 car17 car18 car19 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 loc15 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc5)
    (at car1 loc9)
    (at car2 loc1)
    (at car3 loc3)
    (at car4 loc1)
    (at car5 loc7)
    (at car6 loc5)
    (at car7 loc13)
    (at car8 loc6)
    (at car9 loc1)
    (at car10 loc6)
    (at car11 loc3)
    (at car12 loc7)
    (at car13 loc5)
    (at car14 loc14)
    (at car15 loc7)
    (at car16 loc1)
    (at car17 loc9)
    (at car18 loc8)
    (at car19 loc10)
)
 (:goal (and 
(at car1 loc7)
(at car2 loc2)
(at car3 loc5)
(at car4 loc5)
))
)

; plan
1. (sail loc5 loc1)
   deleted: (at-ferry loc5)
   added: (at-ferry loc1)
   goals met: 0 of 4
2. (board car4 loc1)
   deleted: (at car4 loc1) (empty-ferry)
   added: (on car4)
   goals met: 0 of 4
3. (sail loc1 loc5)
   deleted: (at-ferry loc1)
   added: (at-ferry loc5)
   goals met: 0 of 4
4. (debark car4 loc5)
   deleted: (on car4)
   added: (at car4 loc5) (empty-ferry)
   goals met: 1 of 4
5. (sail loc5 loc1)
   deleted: (at-ferry loc5)
   added: (at-ferry loc1)
   goals met: 1 of 4
6. (board car2 loc1)
   deleted: (at car2 loc1) (empty-ferry)
   added: (on car2)
   goals met: 1 of 4
7. (sail loc1 loc2)
   deleted: (at-ferry loc1)
   added: (at-ferry loc2)
   goals met: 1 of 4
8. (debark car2 loc2)
   deleted: (on car2)
   added: (at car2 loc2) (empty-ferry)
   goals met: 2 of 4
9. (sail loc2 loc3)
   deleted: (at-ferry loc2)
   added: (at-ferry loc3)
   goals met: 2 of 4
10. (board car3 loc3)
   deleted: (at car3 loc3) (empty-ferry)
   added: (on car3)
   goals met: 2 of 4
11. (sail loc3 loc5)
   deleted: (at-ferry loc3)
   added: (at-ferry loc5)
   goals met: 2 of 4
12. (debark car3 loc5)
   deleted: (on car3)
   added: (at car3 loc5) (empty-ferry)
   goals met: 3 of 4
13. (sail loc5 loc9)
   deleted: (at-ferry loc5)
   added: (at-ferry loc9)
   goals met: 3 of 4
14. (board car1 loc9)
   deleted: (at car1 loc9) (empty-ferry)
   added: (on car1)
   goals met: 3 of 4
15. (sail loc9 loc7)
   deleted: (at-ferry loc9)
   added: (at-ferry loc7)
   goals met: 3 of 4
16. (debark car1 loc7)
   deleted: (on car1)
   added: (at car1 loc7) (empty-ferry)
   goals met: 4 of 4
